ERP.belugaerp/src/Catalogs/СертификатыНоменклатуры/СертификатыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СертификатыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_УдалитьАдресФайлаСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВладелецСертификата</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Бессрочный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаСрокаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСрокаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/бг_СопроводительныеДокументы/бг_СопроводительныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бг_СопроводительныеДокументы</name>
  <owners>Catalog.СерииНоменклатуры</owners>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.ХарактеристикиНоменклатуры</owners>
  <owners>Catalog.СертификатыНоменклатуры</owners>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.бг_ВидыСопроводительныхДокументов</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/CommonModules/бг_СертификатыНоменклатурыИнтеграция/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ОставитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		ВыгружаемыеРеквизиты());
		
	ДобавитьКлючевыеПоляКВыгрузке(РеквизитыИСвойства);	
	
КонецПроцедуры

Процедура ЗаполнитьТекстыЗапросовУсловиями(ТекстЗапроса, ТекстЗапросаТаблицаКлючей, ПараметрыЗапроса, НастройкаВыгрузки, Объект, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ПараметрыЗапроса.Вставить("ВидДокументаДекларацияСоответствия", бг_КонстантыПовтИсп.ЗначениеКонстанты("ВидДокументаДекларацияСоответствия"));
	ТекстПоиска = "
		|ИЗ
		|	Справочник.СертификатыНоменклатуры КАК ВыгружаемыйОбъект";
	ТекстЗамены = "
		|ИЗ
		|	Справочник.СертификатыНоменклатуры КАК ВыгружаемыйОбъект
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бг_СопроводительныеДокументы КАК ДекларацияСоответствия
		|		ПО ВыгружаемыйОбъект.Ссылка = ДекларацияСоответствия.Владелец
		|			И ДекларацияСоответствия.Вид = &ВидДокументаДекларацияСоответствия";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);

	ТекстПоиска = "&УсловиеЗапроса";
	ТекстЗамены = "ВыгружаемыйОбъект.Ссылка = &Ссылка
	|	И &УсловиеЗапроса";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);
		
	ТекстПоиска = "NULL КАК бг_АдресФайлаСертификата";
	ТекстЗамены = "ЕСТЬNULL(ДекларацияСоответствия.ПутьКФайлу, """") КАК бг_АдресФайлаСертификата";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()
	
	ВыгружаемыеРеквизиты = Новый Массив;
	
	ВыгружаемыеРеквизиты.Добавить("Бессрочный");	
	ВыгружаемыеРеквизиты.Добавить("ДатаНачалаСрокаДействия");
	ВыгружаемыеРеквизиты.Добавить("ДатаОкончанияСрокаДействия");
	ВыгружаемыеРеквизиты.Добавить("Наименование");
	ВыгружаемыеРеквизиты.Добавить("Номер");
	ВыгружаемыеРеквизиты.Добавить("ТипСертификата");
	ВыгружаемыеРеквизиты.Добавить("бг_ВладелецСертификата");
	ВыгружаемыеРеквизиты.Добавить("ОрганВыдавшийДокумент");
	
	ВыгружаемыеРеквизиты = СтрСоединить(ВыгружаемыеРеквизиты, ",");
	
	Возврат ВыгружаемыеРеквизиты;
	
КонецФункции

Процедура ДобавитьКлючевыеПоляКВыгрузке(РеквизитыИСвойства)

	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.Организации,
		"ИНН");
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.Организации,
		"КПП");
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // ИмяРеквизита
		"бг_АдресФайлаСертификата",
		ОбщегоНазначения.ОписаниеТипаСтрока(1024));
				
КонецПроцедуры

#КонецОбласти
